lvgl-micropython/lvgl_micropython/micropy_updates/esp32/machine_hw_spi.c
        case ESP_ERR_INVALID_STATE:
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("SPI device already freed"));
            return;
    }
    int cs = (int)mp_obj_get_int(self->cs);

    if (cs != -1) {
        esp_rom_gpio_pad_select_gpio(cs);
        esp_rom_gpio_connect_out_signal(cs, SIG_GPIO_OUT_IDX, false, false);
        gpio_set_direction(cs, GPIO_MODE_INPUT);
    }

    mp_machine_hw_spi_bus_remove_device(self);
}


static void machine_hw_spi_device_deinit(mp_obj_base_t *self_in)
{
    mp_machine_hw_spi_device_obj_t *self = (mp_machine_hw_spi_device_obj_t *)self_in;
    machine_hw_spi_device_deinit_internal(self);
}


static mp_uint_t gcd(mp_uint_t x, mp_uint_t y)
{
    while (x != y) {
        if (x > y) {
            x -= y;
        } else {
            y -= x;
        }
    }
    return x;
}

static void disable_gpio(int gpio_num) {
    if (gpio_num != -1) {
        esp_rom_gpio_pad_select_gpio(gpio_num);
        esp_rom_gpio_connect_out_signal(gpio_num, SIG_GPIO_OUT_IDX, false, false);
        gpio_set_direction(gpio_num, GPIO_MODE_INPUT);
        gpio_reset_pin(gpio_num);
    }
}


void machine_hw_spi_bus_deinit_internal(mp_machine_hw_spi_bus_obj_t *self)
{
    if (self->state == MP_SPI_STATE_STOPPED) return;

    for (uint8_t i = 0; i < self->device_count; i++) {
        self->devices[i]->deinit(self->devices[i]);
        self->devices[i]->active = false;
    }

    self->device_count = 0;
    self->devices = m_realloc(self->devices, self->device_count * sizeof(mp_machine_hw_spi_device_obj_t *));

    switch (spi_bus_free((spi_host_device_t)self->host)) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("invalid configuration"));
            return;

        case ESP_ERR_INVALID_STATE:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("SPI bus already freed"));
            return;
    }

    disable_gpio((int)mp_obj_get_int(self->miso));
    disable_gpio((int)mp_obj_get_int(self->mosi));
    disable_gpio((int)mp_obj_get_int(self->sck));
    disable_gpio((int)mp_obj_get_int(self->data2));
    disable_gpio((int)mp_obj_get_int(self->data3));
    disable_gpio((int)mp_obj_get_int(self->data4));
    disable_gpio((int)mp_obj_get_int(self->data5));
    disable_gpio((int)mp_obj_get_int(self->data6));
    disable_gpio((int)mp_obj_get_int(self->data7));

    self->state = MP_SPI_STATE_STOPPED;
}



static mp_obj_t machine_hw_spi_bus_deinit(mp_obj_t self_in)
{
    mp_machine_hw_spi_bus_obj_t *self = MP_OBJ_TO_PTR(self_in);
    machine_hw_spi_bus_deinit_internal(self);
    return mp_const_none;
}

MP_DEFINE_CONST_FUN_OBJ_1(machine_hw_spi_bus_deinit_obj, machine_hw_spi_bus_deinit);


static void machine_hw_spi_device_transfer(mp_obj_base_t *self_in, size_t len, const uint8_t *src, uint8_t *dest)
{
    mp_machine_hw_spi_device_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (!self->active) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("SPI device is no longer attached to a bus"));
        return;
    }
    if (self->spi_bus->state == MP_SPI_STATE_STOPPED) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("SPI bus is no longer active"));
        return;
    }

    spi_device_handle_t spi_device = (spi_device_handle_t)self->user_data;
    spi_device_acquire_bus(spi_device, portMAX_DELAY);

    // Round to nearest whole set of bits
    int bits_to_send = len * 8 / self->bits * self->bits;

    if (!bits_to_send) {
        mp_raise_ValueError(MP_ERROR_TEXT("buffer too short"));
    }

    if (len <= 4) {
        spi_transaction_t transaction = { 0 };

        if (src != NULL) {
            memcpy(&transaction.tx_data, src, len);
        }

        transaction.flags = SPI_TRANS_USE_TXDATA | SPI_TRANS_USE_RXDATA;
        transaction.length = bits_to_send;

        if (self->dual) {
            transaction.flags |= SPI_TRANS_MODE_DIO;
        } else if (self->quad) {
            transaction.flags |= SPI_TRANS_MODE_QIO;
        } else if (self->octal) {
            transaction.flags |= SPI_TRANS_MODE_OCT;
        }

        spi_device_transmit(spi_device, &transaction);

        if (dest != NULL) {
            memcpy(dest, &transaction.rx_data, len);
        }
    } else {
        int offset = 0;
        int bits_remaining = bits_to_send;
        int optimum_word_size = 8 * self->bits / gcd(8, self->bits);
        int max_transaction_bits = SPI_LL_DMA_MAX_BIT_LEN / optimum_word_size * optimum_word_size;
        spi_transaction_t *transaction, *result, transactions[2];
        int i = 0;


        while (bits_remaining) {
            transaction = transactions + i++ % 2;
            memset(transaction, 0, sizeof(spi_transaction_t));

            if (bits_remaining > max_transaction_bits) {
                transaction->length = max_transaction_bits;
                transaction->flags |= SPI_TRANS_CS_KEEP_ACTIVE;
            } else {
                transaction->length = bits_remaining;
            }

            if (src != NULL) {
                transaction->tx_buffer = src + offset;
                transaction->flags |= SPI_TRANS_USE_TXDATA;
            }
            if (dest != NULL) {
                transaction->rx_buffer = dest + offset;
                transaction->flags |= SPI_TRANS_USE_RXDATA;
            }

            if (self->dual) {
                transaction->flags |= SPI_TRANS_MODE_DIO;
            } else if (self->quad) {
                transaction->flags |= SPI_TRANS_MODE_QIO;
            } else if (self->octal) {
                transaction->flags |= SPI_TRANS_MODE_OCT;
            }

            spi_device_queue_trans(spi_device, transaction, portMAX_DELAY);
            bits_remaining -= transaction->length;

            if (offset > 0) {
                // wait for previously queued transaction
                MP_THREAD_GIL_EXIT();
                spi_device_get_trans_result(spi_device, &result, portMAX_DELAY);
                MP_THREAD_GIL_ENTER();
            }

            // doesn't need ceil(); loop ends when bits_remaining is 0
            offset += transaction->length / 8;
        }

        // wait for last transaction
        MP_THREAD_GIL_EXIT();
        spi_device_get_trans_result(spi_device, &result, portMAX_DELAY);
        MP_THREAD_GIL_ENTER();
    }

    spi_device_release_bus(spi_device);
}

/******************************************************************************/
// MicroPython bindings for hw_spi

mp_obj_t machine_hw_spi_bus_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {

