lvgl-micropython/lvgl_micropython/micropy_updates/esp32/machine_hw_spi.c
    enum { ARG_host, ARG_mosi, ARG_miso, ARG_sck, ARG_quad_pins, ARG_octal_pins };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_host,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_mosi,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_miso,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_sck,        MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_quad_pins,  MP_ARG_KW_ONLY | MP_ARG_OBJ,  { .u_obj = mp_const_none } },
        { MP_QSTR_octal_pins, MP_ARG_KW_ONLY | MP_ARG_OBJ,  { .u_obj = mp_const_none } },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    uint8_t host = (uint8_t)args[ARG_host].u_int;
    int mosi = (int)args[ARG_mosi].u_int;
    int miso = (int)args[ARG_miso].u_int;
    int sck = (int)args[ARG_sck].u_int;
    int data2 = -1;
    int data3 = -1;
    int data4 = -1;
    int data5 = -1;
    int data6 = -1;
    int data7 = -1;

    bool dual = false;
    bool quad = false;
    bool octal = false;

    mp_machine_hw_spi_bus_obj_t *self;

    if (mosi != -1 && mosi != -1) dual = true;

    if (args[ARG_quad_pins].u_obj != mp_const_none) {
        mp_obj_tuple_t *quad_data_pins = MP_OBJ_TO_PTR(args[ARG_quad_pins].u_obj);

        if (!dual) {
            mp_raise_msg(
                &mp_type_ValueError,
                MP_ERROR_TEXT("You MUST supply both the MISO and MOSI pins to use quad mode")
            );
            return mp_const_none;
        }
        if (quad_data_pins->len != 2) {
            mp_raise_msg_varg(
                &mp_type_ValueError,
                MP_ERROR_TEXT("2 additional pins are mneeded for quad SPI not %d"),
                quad_data_pins->len
            );
            return mp_const_none;
        }

        data2 = (int)mp_obj_get_int(quad_data_pins->items[0]);
        data3 = (int)mp_obj_get_int(quad_data_pins->items[1]);

        quad = true;
        octal = false;

    } else if (args[ARG_octal_pins].u_obj != mp_const_none) {
        mp_obj_tuple_t *octal_data_pins = MP_OBJ_TO_PTR(args[ARG_octal_pins].u_obj);

        if (!dual) {
            mp_raise_msg(
                &mp_type_ValueError,
                MP_ERROR_TEXT("You MUST supply both the MISO and MOSI pins to use octal mode")
            );
            return mp_const_none;
        }

        if (octal_data_pins->len != 6) {
            mp_raise_msg_varg(
                &mp_type_ValueError,
                MP_ERROR_TEXT("6 additional pins are needed for octal SPI not %d"),
                octal_data_pins->len
            );
            return mp_const_none;
        }

        data2 = (int)mp_obj_get_int(octal_data_pins->items[0]);
        data3 = (int)mp_obj_get_int(octal_data_pins->items[1]);
        data4 = (int)mp_obj_get_int(octal_data_pins->items[2]);
        data5 = (int)mp_obj_get_int(octal_data_pins->items[3]);
        data6 = (int)mp_obj_get_int(octal_data_pins->items[4]);
        data7 = (int)mp_obj_get_int(octal_data_pins->items[5]);

        quad = true;
        octal = true;
    }

    if (1 <= host && host <= MICROPY_HW_SPI_MAX) {
        self = machine_hw_spi_bus_objs[host - 1];
    } else {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) doesn't exist"), host);
        return mp_const_none;
    }

    bool reconfigure = false;

    if (self == NULL) {
        reconfigure = true;
        self = m_new_obj(mp_machine_hw_spi_bus_obj_t);
        self->base.type = &mp_machine_hw_spi_bus_type;
        self->host = host;
        self->deinit = &machine_hw_spi_bus_deinit_internal;
        machine_hw_spi_bus_objs[host - 1] = self;
    } else {
        if ((int)mp_obj_get_int(self->mosi) != mosi) reconfigure = true;
        if ((int)mp_obj_get_int(self->miso) != miso) reconfigure = true;
        if ((int)mp_obj_get_int(self->sck) != sck) reconfigure = true;
        if ((int)mp_obj_get_int(self->data2) != data2) reconfigure = true;
        if ((int)mp_obj_get_int(self->data3) != data3) reconfigure = true;
        if ((int)mp_obj_get_int(self->data4) != data4) reconfigure = true;
        if ((int)mp_obj_get_int(self->data5) != data5) reconfigure = true;
        if ((int)mp_obj_get_int(self->data6) != data6) reconfigure = true;
        if ((int)mp_obj_get_int(self->data7) != data7) reconfigure = true;
    }

    if (reconfigure) {
        if (self->device_count > 0) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) has active devices, unable to change pins"), host);
            return mp_const_none;
        }

        self->miso = mp_obj_new_int((mp_int_t)miso);
        self->mosi = mp_obj_new_int((mp_int_t)mosi);
        self->sck = mp_obj_new_int((mp_int_t)sck);
        self->data2 = mp_obj_new_int((mp_int_t)data2);
        self->data3 = mp_obj_new_int((mp_int_t)data3);
        self->data4 = mp_obj_new_int((mp_int_t)data4);
        self->data5 = mp_obj_new_int((mp_int_t)data5);
        self->data6 = mp_obj_new_int((mp_int_t)data6);
        self->data7 = mp_obj_new_int((mp_int_t)data7);
        self->dual = dual;
        self->quad = quad;
        self->octal = octal;
    }

    return MP_OBJ_FROM_PTR(self);
}


void mp_machine_hw_spi_bus_initilize(mp_machine_hw_spi_bus_obj_t *bus)
{
    if (bus->state != MP_SPI_STATE_STOPPED) return;

    uint32_t flags = 0;

    if (bus->dual) flags |= SPICOMMON_BUSFLAG_DUAL;
    if (bus->quad) flags |= SPICOMMON_BUSFLAG_QUAD;
    if (bus->octal) flags |= SPICOMMON_BUSFLAG_OCTAL;

    spi_bus_config_t buscfg = {
        .miso_io_num = (int)mp_obj_get_int(bus->miso),
        .mosi_io_num = (int)mp_obj_get_int(bus->mosi),
        .sclk_io_num = (int)mp_obj_get_int(bus->sck),
        .data2_io_num = (int)mp_obj_get_int(bus->data2),
        .data3_io_num = (int)mp_obj_get_int(bus->data3),
        .data4_io_num = (int)mp_obj_get_int(bus->data4),
        .data5_io_num = (int)mp_obj_get_int(bus->data5),
        .data6_io_num = (int)mp_obj_get_int(bus->data6),
        .data7_io_num = (int)mp_obj_get_int(bus->data7),
        .flags = flags,
        .max_transfer_sz = SPI_LL_DMA_MAX_BIT_LEN / 8
    };

    esp_err_t ret;

#if CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3
    ret = spi_bus_initialize((spi_host_device_t)bus->host, &buscfg, SPI_DMA_CH_AUTO);
#else
    if (bus->host == SPI2_HOST) {
        ret = spi_bus_initialize((spi_host_device_t)bus->host, &buscfg, 1);
    } else {
        ret = spi_bus_initialize((spi_host_device_t)bus->host, &buscfg, 2);
    }
#endif

    switch (ret) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) invalid configuration"), bus->host);
            return;

